[
    {
        "id": "1",
        "name": "Scalable Day Trading Application",
        "date": "April 2023",
        "preview": "Distributed day trading application using gRPC, NextJS, MaterialUI, and more.",
        "description": "Day-Trader is a scalable day trading application developed as part of UVic's Scalable Systems offering (SENG 468). It provides users with the ability to engage in day trading activities through a user-friendly GUI and a command-line interface (CLI).\n\nThe architecture of Day-Trader is designed for scalability and efficiency. It consists of various components such as the Web Browser, Next Server, CLI, Transaction Server, Database (Postgres), Quote Server Adaptor, and Uvic Quote Server. These components communicate with each other using gRPC calls and TCP sockets to handle user requests, update the database, and retrieve stock quotes.\n\n This project included three students, with my primary contributions being to the frontend.",
        "images": [
            "https://github.com/MarcusDunn/day-trader/blob/main/readmeimages/1.png?raw=true",
            "https://github.com/MarcusDunn/day-trader/blob/main/readmeimages/2.png?raw=true",
            "https://github.com/MarcusDunn/day-trader/blob/main/readmeimages/3.png?raw=true",
            "https://github.com/MarcusDunn/day-trader/blob/main/readmeimages/4.png?raw=true"
        ],
        "github": "https://github.com/MarcusDunn/day-trader",
        "website": null
    },
    {
        "id": "2",
        "name": "Miguel Manguerra's Portfolio",
        "date": "August 2022",
        "preview": "Portfolio containing Miguel's projects using NextJS with MaterialUI components.",
        "description": "Portfolio containing Miguel's projects using NextJS with MaterialUI components.",
        "images": [
            "/images/migoy1.png",
            "/images/migoy2.png",
            "/images/migoy3.png",
            "/images/migoy4.png"
        ],
        "github": "https://github.com/peterrwilson99/miguel-next",
        "website": "https://miguelmanguerra.vercel.app/"
    },
    {
        "id": "3",
        "name": "Quizzie - A Quiz App for Midterm Preparation",
        "date": "February 2023",
        "preview": "A quiz app for UVIC courses lacking practice midterms, using AI tooling to generate realistic questions from notes.",
        "description": "Quizzie is a quiz application developed to provide students with practice materials for midterms that lacked official practice exams. Built using NextJS, React, and MaterialUI components, Quizzie offers an intuitive interface for students to test their knowledge. \n\nUsing markdown notes and ChatGPT, we generated quizzes in a specific JSON format that could be directly imported into the React Quiz component. Originally designed for a single midterm, the app evolved to accommodate multiple classes and tests, attracting a community of students seeking comprehensive test preparation. \n\nWith NextJS, React, and MaterialUI, Quizzie delivers a visually appealing and user-friendly experience. Its intelligent quiz generation system, powered by ChatGPT, ensures a wide range of questions to cover the course material effectively.",
        "images": [
            "/images/quizzie1.png",
            "/images/quizzie2.png",
            "/images/quizzie3.png"
        ],
        "github": "https://github.com/peterrwilson99/QuizApp",
        "website": "https://quizzie-uvic.vercel.app/"
    },
    {
        "id": "4",
        "name": "Wordle Solver",
        "date": "November 2022",
        "preview": "A python application to solve Wordles using a large word list and a word frequency list.",
        "description": "This Python application serves as a handy Wordle helper, providing options and suggestions for the popular word-guessing game. By employing various methods and functionalities, such as removing letters, checking the existence of specific letters at certain indices, and generating top guess words, the application assists users in narrowing down the potential solutions.\n\nAs this was a simple quick project for myself there is currently no user interface, and future work could include creating a Flask server to where a frontend application could query this tool.",
        "images": [
            "/images/wordle1.png"
        ],
        "github": "https://github.com/peterrwilson99/WordleHelp",
        "website": null
    },
    {
        "id": "5",
        "name": "Sudoku",
        "date": "September 2021",
        "preview": "A simple sudoku application built using create-react-app and basic React components.",
        "description": "A simple sudoku application built using create-react-app and basic React components.",
        "images": [
            "/images/sudoku1.png"
        ],
        "github": null,
        "website": "https://pitasudoku.web.app/"
    },
    {
        "id": "6",
        "name": "Pretty Clock",
        "date": "October 2022",
        "preview": "A simple web application to display the time with an aesthetic background.",
        "description": "A simple web application to display the time with an aesthetic background using NextJS and Vercel. Great for work stations where a monitor isn't being used. Uses Unsplash.com for its random image generator, where every minute the application grabs a new image to display.",
        "images": [
            "/images/clock1.png",
            "/images/clock2.png"
        ],
        "github": null,
        "website": "https://prettyclock.vercel.app/"
    }
]